Repository: mickbad/youtube_downloader_flutter
Catalog: lib/l10n/app_*.arb
Languages: fr, it, pt, ur, zh, zh_tc

# title
source: Youtube Downloader
zh: YT下载者
zh_tc: YT下載者

# startSearch
source: Put your video or playlist URL!
fr: Saisissez une URL d'une vidéo ou d'une playlist
it: Inserisci l'URL di un video o di una playlist
pt: Inicie sua busca!
ur: !تلاش شروع کرو
zh: 写到视频网址或者播放列表网址
zh_tc: 寫到視頻網址或者播放列表網址

# searchUrl
source: Download URL
fr: Télécharger l'URL
it: Download l'URL
zh: 下载网址
zh_tc: 下載網址

# searchUrlTooltip
source: Paste your URL from clipboard
fr: Coller votre url depuis le presse papier
it: Incolla la tua URL dal appunti
zh: 从剪贴板粘贴网址
zh_tc: 從剪貼板粘貼網址

source: OK
zh: 确定 (OK)
zh_tc: 確定 (OK)

source: Cancel
fr: Annuler
it: Annulla
pt: Cancelar
zh: 取消
zh_tc: 取消

source: Settings
fr: Paramètres
it: Impostazioni
pt: Configurações
ur: ترتیبات
zh: 设定
zh_tc: 設定

source: Dark Mode
fr: Mode nuit
it: Modalità scura
pt: Modo Noturno
ur: اندھیرا موڈ
zh: 神色主题
zh_tc: 神色主題

# ffmpegPath
source: Path to FFMPEG's location
fr: Chemin d'accès à FFMPEG
it: Percorso del FFMPEG
pt: FFMPEG path localisation
zh: FFMPEG路径位置
zh_tc: FFMPEG路徑位置

# ffmpegContainer
source: FFPEG container
fr: FFMPEG extension
it: FFMPEG estenzione
pt: FFMPEG container
ur: ffmpeg ڈبہ
zh: FFMPEG扩展名
zh_tc: FFMPEG擴展名

# ffmpegDescription
source: This is the output format when two tracks (audio + video) are merged
fr: Format de sortie pour fusionner deux pistes (audio + video)
it: Il format di output quando due tracce (audio + video) vengono unite
pt: Este é o formato de saida quando dois arquivos (audio + video) são mesclados
ur: یہ آؤٹ پٹ فارمیٹ ہے جب دو ٹریکس (آڈیو + ویڈیو) آپس میں ضم ہوتے ہیں۔
zh: 两条轨（音响+视频）合并后这是输出的格式
zh_tc: 兩條軌（音響+視頻）合并後這是輸出的格式

# ffmpegNotFound
source: FFMPEG not found in PATH or not configured
fr: FFMPEG introuvable dans le PATH ou non configuré
it: FFMPEG non trovato in PATH o non configurato
pt: FFMPEG não foi encontrado em PATH ou não configurado
ur: میں Path ملا نہیں FFMPEG or not configured
zh: FFMPEG在路径没找到，还是FFMPEG不好构成的
zh_tc: FFMPEG在路徑沒找到，還是FFMPEG不好構成的

source: Language
fr: Langage
it: Lingua
pt: Idioma
ur: زبان
zh: 语言
zh_tc: 語言

# downloadDir
source: Download Directory
fr: Dossier de téléchargement
it: Cartella Download
pt: Local de armazenamento
ur: ڈائریکٹری ڈاؤن لوڈ
zh: 下载目录
zh_tc: 下載目錄

# selectDownloadDir
source: Select download directory
fr: Sélectionnez un dossier de téléchargement
it: Selezione la cartella per i download
pt: Selecione uma pasta para download
ur: ڈاؤن لوڈ ڈائریکٹری منتخب کریں۔
zh: 请选择目录
zh_tc: 請選擇目錄

# invalidDir
source: Invalid directory
fr: Dossier invalide
it: Cartella non valida
pt: Local de armazenamento inválido
ur: غلط ڈائریکٹری
zh: 目录无效
zh_tc: 目錄無效

# credits
source: App credits
fr: Crédits de l'application
it: Crediti dell'app
pt: Application credits
ur: Application credits
zh: 应用的片尾
zh_tc: 應用的片尾

# credits_content
source: Graphics: https://www.flaticon.com/authors/freepik Original Author: https://github.com/Hexer10 Edited by: https://github.com/mickbad
fr: Graphiques : https://www.flaticon.com/authors/freepik Auteur original : https://github.com/Hexer10 Modifications : https://github.com/mickbad
it: Graphica: https://www.flaticon.com/authors/freepik Autore originale: https://github.com/Hexer10 A cura di: https://github.com/mickbad
pt: Graphics: https://www.flaticon.com/authors/freepik Original Author: https://github.com/Hexer10 Modified: https://github.com/mickbad
ur: Graphics: https://www.flaticon.com/authors/freepik Original Author: https://github.com/Hexer10 Modified: https://github.com/mickbad
zh: 图形：https://www.flaticon.com/authors/freepik 原创作者：https://github.com/Hexer10 改写：https://github.com/mickbad
zh_tc: 圖形：https://www.flaticon.com/authors/freepik 原創作者：https://github.com/Hexer10 改寫：https://github.com/mickbad

source: Downloads
fr: Téléchargements
pt: Transferências
ur: ڈاؤن لوڈز
zh: 下载
zh_tc: 下載

source: Author
fr: Auteur
it: Autore
pt: Autor
ur: مصنف
zh: 创作者
zh_tc: 創作者

# uploadDateRow
source: Published
fr: Publication
it: Pubblicato
pt: Publicada
zh: 发表
zh_tc: 發表

# downloadCleanUpList
source: Clean download list (none deleted)
fr: Nettoyer la liste (aucune suppression)
it: Lista delle download pulita (nessuna cancellamento)
pt: Lista limpa (sem eliminação)
zh: 整理下载目录（无删除文件）
zh_tc: 整理下載目錄（無刪除文件）

# downloadCleanUpListConfirm
source: Are you sure you want to clean the download list?
fr: Voulez-vous vraiment nettoyer la liste de téléchargements ?
it: Cancellare la lista delle download?
pt: Quer mesmo limpar a lista de downloads?
zh: 确定清理下载目录吗？
zh_tc: 確定清理下載目錄嗎？

# navigateToDownloadPage
source: Download Page
fr: Page des téléchargements
it: Scarica la pagina
pt: Página de download
zh: 下载页面
zh_tc: 下載頁面

# navigateToDownloadPageConfirm
source: Do you want to navigate to the download page?
fr: Voulez-vous naviguer vers la page des téléchargements ?
it: Vuoi andare alla pagina di download?
pt: Quer navegar até à página de download?
zh: 您想导航至下载页面吗？
zh_tc: 您想導航至下載頁面嗎？

# tracksTooltip
source: Tap on line to download stream or long tap to select stream for merge
fr: Tapez sur une ligne pour télécharger ou un appui long pour sélectionner la fusion
it: Tocca sulla linea per download il stream, o premere a lungo per selezionare più stream
pt: Toque na linha para descarregar o fluxo ou toque longo para selecionar o fluxo a fundir
zh: 敲排为下载流程，或者长按排多种流程为合并
zh_tc: 敲排為下載流程，或者長按排多種流程為合并

# mergeTracks
source: Download & Merge tracks!
fr: Télécharger et fusionner les pistes !
it: Download i Unire le tracce!
pt: Descarregue e mescle faixas!
zh: 下载和合并轨！
zh_tc: 下載和合并軌！

# tracksBestMerge
source: Best video + audio quality
fr: Meilleure qualité vidéo et audio
it: Il migliore video + qualità dell'audio
pt: Melhor qualidade de vídeo + áudio
zh: 最硬视频和最硬音响
zh_tc: 最硬視頻和最硬音響

# tracksAll
source: All
fr: Tout
it: Tutto
pt: Tudo
zh: 都
zh_tc: 都

# tracksVideoAudio
source: Video + Audio
fr: Vidéo et Audio
pt: Vídeo + Áudio
zh: 视频和音响
zh_tc: 視頻和音響

# tracksVideo
source: Video Only
fr: Vidéo seulement
it: Solo il video
pt: Somente vídeo
zh: 只下载视频
zh_tc: 只下載視頻

# tracksAudio
source: Audio Only
fr: Audio seulement
it: Solo il audio
pt: Somente áudio
zh: 只下载音响
zh_tc: 只下載音響

# trackID3EditTooltip
source: Update mp3 ID3
fr: Mettre à jour les tags ID3
it: Aggiorna le tag ID3
zh: 更新ID3标记
zh_tc: 更新ID3標記

# trackID3Tooltip
source: Update mp3 informations
fr: Modifiez les informations du mp3
it: Cambia le informazioni dell'MP3
zh: 更新MP3的信息存储
zh_tc: 更新MP3的信息存儲

# trackID3FieldTitle
source: Title
fr: Titre
it: Titolo
zh: 曲名
zh_tc: 曲名

# trackID3FieldArtist
source: Author / Artist
fr: Auteur
it: Autore
zh: 演唱者
zh_tc: 演唱者

# trackID3FieldAlbum
source: Album
zh: 专辑
zh_tc: 專輯

# trackID3Action
source: Update
fr: Appliquez
it: Salva
zh: 储存
zh_tc: 儲存

# playlistParsing
source: Playlist parsing: {percent}%
fr: Lecture de la playlist : {percent} %
it: Riproducendo la playlist: {percent} %
zh: 播放列表分析处理：{percent}%
zh_tc: 播放列表分析處理：{percent}%

# playlistTooltip
source: Tap on line to select or deselect video to download
fr: Tapez sur la ligne pour sélectionner ou déselectionner un titre de la liste
it: Tocca sulla linea per selezionare o deselezionare un titolo della lista
zh: 敲排为选择或取消选择视频
zh_tc: 敲排為選擇或取消選擇視頻

# playlistTitle
source: List of all {count} videos or audios to download
fr: Liste des {count} vidéos ou audios à télécharger
it: Lista dei {count} video da download
zh: {count}段要下载的视频
zh_tc: {count}段要下載的視頻

# playlistDownloadVideos
source: Download videos + audios
fr: Télécharger les vidéos + audios
it: Download i video + audio
zh: 视频和音响下载
zh_tc: 視頻和音響下載

# playlistDownloadAudiosOnly
source: Download audios
fr: Télécharger les audios
it: Download i audio
zh: 音响下载
zh_tc: 音響下載

# playlistDownloadVideosOnly
source: Download videos
fr: Télécharger les vidéos
it: Download i video
zh: 视频下载
zh_tc: 視頻下載

# settingsQuotaTitle
source: Download quota
fr: Quota de téléchargement
it: Quota di download
zh: 下载指标
zh_tc: 下載指標

# settingsQuotaDescription
source: The max number of authorized concurrent download and transform streams
fr: Nombre de téléchargements et de conversions simultanés
it: Numero di download i converzione simultanee
zh: 允许的同期下载和变换数
zh_tc: 允許的同期下載和變換數

# settingsLeadingZeroTitle
source: Playlist: filename header
fr: Playlist : préfixe du nom du fichier
it: Playlist: prefisso sul nome del file
zh: 播放列表：文件名称的前冠
zh_tc: 播放列表：文件名稱的前冠

# settingsLeadingZeroDescription
source: Add a leading zero in the pathname when dowloading a playlist
fr: Ajout de zéro en tête de nom du fichier pour les téléchargements de playlist
it: Aggiunto lo zero iniziale al nome del file per i download delle playlist
zh: 为播放列表下载加文件名称前零号
zh_tc: 為播放列表下載加文件名稱前零號

# permissionError
source: The app needs the storage permission to download files!
fr: L'application a besoin des permissions de stockage pour télécharger les fichiers !
it: L'app necessità del permesso di storage per scaricare i contenuti!
pt: O applicativo precisa ter acesso ao seu armazenamento para realizar seus downloads!
ur: !ایپ کو فائلیں ڈاؤن لوڈ کرنے کے لیے اسٹوریج کی اجازت درکار ہے
zh: 应用为下载文件必需储存允准！
zh_tc: 應用為下載文件必需儲存允准！

# startDownload
source: Started downloading: {title}
fr: Démarrage du téléchargement : {title}
it: Inizio download: {title}
pt: Iniciando download: {title}
ur: {title}: ڈاؤن لوڈ کرنا شروع ہوا
zh: {title}的下载开始了
zh_tc: {title}的下載開始了

# failDownload
source: Downloading failed: {title}
fr: Echec de téléchargement : {title}
it: Download fallito: {title}
pt: Ocorreu um erro em: {title}
ur: {title}: ڈاؤن لوڈنگ ناکام ہو گئی۔
zh: {title}的下载失败了
zh_tc: {title}的下載失敗了

# cancelDownload
source: Downloading cancelled: {title}
fr: Téléchargement annulé : {title}
it: Download cancellato: {title}
pt: Download cancelado: {title}
ur: {title}: ڈاؤن لوڈنگ منسوخ کر دی گئی۔
zh: {title}的下载取消了
zh_tc: {title}的下載取消了

# finishDownload
source: Downloading finished: {title}
fr: Téléchargement terminé: {title}
it: Download completato: {title}
pt: Download finalizado: {title}
ur: {title}: ڈاؤن لوڈ مکمل ہو گیا۔
zh: {title}的下载完了
zh_tc: {title}的下載完了

# startMerge
source: Merging tracks of: {title}
fr: Fusion des pistes de : {title}
it: Unificando le traccie: {title}
pt: Mesclando arquivos de: {title}
ur: {title}: ٹریکس کو ضم کرنا
zh: {title}的轨在合并
zh_tc: {title}的軌在合并

# cancelMerge
source: Cancelled merge of: {title}
fr: Annulation de la fusion de : {title}
it: Unificazione cancellata: {title}
pt: Junção cancelada: {title}
ur: {title}: انضمام منسوخ کر دیا گیا۔
zh: {title}的合并取消了
zh_tc: {title}的合并取消了

# finishMerge
source: Merge finished: {title}
fr: Fusion terminée : {title}
it: Video completo: {title}
pt: Finalizado a junção de: {title}
ur: {title}: ضم ہو گیا۔
zh: {title}的合并完了
zh_tc: {title}的合并完了

# finishConvert
source: Convertion finished: {title}
fr: Convertion terminée : {title}
it: Converzione finito: {title}
zh: {title}的变换完了
zh_tc: {title}的變換完了
